<a href="https://colab.research.google.com/github/martin-fabbri/colab-notebooks/blob/master/product-analytics/customer_segmentation.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# A/B Testing

## Cohort Analysis

### Time cohorts

In [0]:
#@title ## Setup
#@markdown * Import dependencies
#@markdown * App purchases
#@markdown ---
#@markdown **Data Set Information:**
#@markdown Syntetic app purchases dataset

import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import matplotlib.colors as mcolors

from datetime import datetime
from datetime import timedelta

!wget https://raw.githubusercontent.com/martin-fabbri/colab-notebooks/master/data/ab_testing_customer_data.csv -q
!wget https://raw.githubusercontent.com/martin-fabbri/colab-notebooks/master/data/ab_testing_app_purchase.csv -q

In [0]:
customer_data = pd.read_csv('ab_testing_customer_data.csv')
app_purchases = pd.read_csv('ab_testing_app_purchase.csv')

In [5]:
customer_data.head(3)

        uid country gender  spent  purchases        date  group device
0  11115722     MEX      F   1595          5  2016-03-08  GRP B      I
1  11122053     USA      M    498          2  2017-07-14  GRP B      I
2  11128688     USA      F   2394          6  2017-09-17  GRP A      I

In [6]:
app_purchases.head(3)

         date       uid            sku  price
0   7/10/2017  11115722  sku_three_499    499
1   7/15/2017  11122053  sku_three_499    499
2  11/12/2017  11128688   sku_four_599    599

In [7]:
uid_combined_data = app_purchases.merge(customer_data, on=['uid'], how='inner')
uid_combined_data.describe()

                uid        price         spent    purchases
count  9.006000e+03  9006.000000   9006.000000  9006.000000
mean   1.985404e+07   406.772596   1897.186986     4.567400
std    5.025477e+06   187.918230   1367.149729     3.121144
min    1.111572e+07    99.000000     99.000000     1.000000
25%    1.556113e+07   299.000000    897.000000     2.000000
50%    1.981417e+07   299.000000   1596.000000     4.000000
75%    2.423075e+07   499.000000   2594.000000     6.000000
max    2.852533e+07   899.000000  11176.000000    24.000000

In [8]:
uid_combined_data.head()

       date_x       uid            sku  ...      date_y  group device
0   7/10/2017  11115722  sku_three_499  ...  2016-03-08  GRP B      I
1   7/15/2017  11122053  sku_three_499  ...  2017-07-14  GRP B      I
2  11/12/2017  11128688   sku_four_599  ...  2017-09-17  GRP A      I
3   9/26/2017  11130578    sku_two_299  ...  2017-11-30  GRP A      I
4   12/1/2017  11130759   sku_four_599  ...  2018-01-10  GRP B      A

[5 rows x 11 columns]

In [9]:
app_purchases.price.agg('mean')

406.77259604707973

In [10]:
app_purchases.price.mean()

406.77259604707973

In [11]:
app_purchases.price.agg(['mean', 'median'])

mean      406.772596
median    299.000000
Name: price, dtype: float64

In [12]:
purchase_summary = uid_combined_data.agg({
    'price': ['mean', 'median'],
    'purchases': ['mean', 'median'],
})
purchase_summary

             price  purchases
mean    406.772596     4.5674
median  299.000000     4.0000

In [13]:
grouped_purchase_data = uid_combined_data.groupby(['device', 'gender'])
purchase_summary = grouped_purchase_data.agg({'price' : ['mean', 'median', 'std']})
purchase_summary

                    price
                     mean median         std
device gender
A      F       413.396355    499  191.364475
       M       402.425846    299  184.641220
I      F       406.091562    299  188.163379
       M       405.455863    299  187.569669

In [24]:
cutoff_date = datetime(2018, 3, 17)
max_purchase_date = cutoff_date - timedelta(days=28)
max_purchase_date

datetime.datetime(2018, 2, 17, 0, 0)

Filter to only include users who registered before our max date

In [23]:
purchase_data_filt = purchase_data[ purchase < ]

datetime.datetime(2018, 3, 17, 0, 0)